import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Desc","appearanceId","graphicLevel","apprance","scale","runAni","idleAni","chaseAni","watchAni","attackAni","carAni","CarIdleAni","attackDelayUI","deathAni","stopTime","offset"],["","","","","","","","","","","","","","","","",""],[1,"普通帕姆尼-可爱",1,3,"86DC3418436A54A579AE4793ED6AD5C7",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[2,"普通帕姆尼-恐怖",1,2,"5D75018D4FBD126ADBB2F08E1B563A2D",1,"122520","122520","122520","14623","232345","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[3,"普通帕姆尼-正常",1,1,"27DF04E74F6184FFA49A45B47266EF5B",1,"122520","122520","122520","14623","232345","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[4,"黑白配色的帕姆尼-可爱",2,3,"86DC3418436A54A579AE4793ED6AD5C7",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[5,"黑白配色的帕姆尼-恐怖",2,2,"9ED3694245A92220207FC096D67BC755",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[6,"黑白配色的帕姆尼-普通",2,1,"C1D1AE1343F05A8BB601AF8FAAEE54FC",1,"122520","122520","122520","14623","232345","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[7,"盯着不动的帕姆尼-可爱",3,3,"86DC3418436A54A579AE4793ED6AD5C7",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[8,"盯着不动的帕姆尼-恐怖",3,2,"9ED3694245A92220207FC096D67BC755",1,"122509","122509","122509","122509","122509","122509","122509",0.6,"52998",1.5,new mw.Vector(65,0,0)],[9,"盯着不动的帕姆尼-可爱",3,1,"C1D1AE1343F05A8BB601AF8FAAEE54FC",1,"122509","122509","122509","122509","122509","122509","122509",0.6,"52998",1.5,new mw.Vector(65,0,0)],[10,"哭泣帕姆尼-可爱",4,3,"86DC3418436A54A579AE4793ED6AD5C7",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[11,"哭泣帕姆尼-恐怖",4,2,"0FEA5853419E1058EFB464A1A2AD5C6B",1,"14655","14655","14655","14655","232345","14569","14569",0.6,"52998",1.5,new mw.Vector(65,0,0)],[12,"哭泣帕姆尼-普通",4,1,"27DF04E74F6184FFA49A45B47266EF5B",1,"14655","14655","14655","14655","232345","14569","14569",0.6,"52998",1.5,new mw.Vector(65,0,0)],[13,"爬行帕姆尼-可爱",5,3,"86DC3418436A54A579AE4793ED6AD5C7",1,"164987","162002","14561","14623","217865","14653","181191",0.6,"52998",1.5,new mw.Vector(65,0,0)],[14,"爬行帕姆尼-恐怖",5,2,"0FEA5853419E1058EFB464A1A2AD5C6B",1,"14570","14570","122520","14655","232345","20276","14569",0.6,"52998",1.5,new mw.Vector(65,0,0)],[15,"爬行帕姆尼-普通",5,1,"8B4C21304645958B0F35FC8E77D77205",1,"14570","14570","122520","14655","232345","20276","14569",0.6,"52998",1.5,new mw.Vector(65,0,0)]];
export interface IGhostGraphicElement extends IElementBase{
 	/**ID*/
	id:number
	/**备注*/
	Desc:string
	/**外观id*/
	appearanceId:number
	/**对应的画质等级*/
	graphicLevel:number
	/**模型（如果是四足对象，则以_开头）*/
	apprance:string
	/**缩放*/
	scale:number
	/**跑动动画*/
	runAni:string
	/**待机动画*/
	idleAni:string
	/**追逐动画*/
	chaseAni:string
	/**观望动画*/
	watchAni:string
	/**攻击动画*/
	attackAni:string
	/**推车动画*/
	carAni:string
	/**推车待机动画*/
	CarIdleAni:string
	/**碎屏UI显示时间*/
	attackDelayUI:number
	/**玩家死亡动画*/
	deathAni:string
	/**玩家死亡动画停止时间*/
	stopTime:number
	/**攻击的时候的偏移*/
	offset:mw.Vector
 } 
export class GhostGraphicConfig extends ConfigBase<IGhostGraphicElement>{
	constructor(){
		super(EXCELDATA);
	}

}