import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","back","tag","viewWeight","imgGuid","unlockedImgGuid","name","name_Desc","unlockTips","unlockTips_Desc","typeDesc","typeDesc_Desc","weekDesc","weekDesc_Desc","backDesc","backDesc_Desc","gfearcoin","gpopular","gprice","activeTime"],["","","","","","","Language","","Language","","Language","","Language","","Language","","","","",""],[1,"帕姆尼","pamuni",0,"297004","338232","ghostName_03","帕姆尼","ghostUnlock_03","恐怖鬼校\n数字马戏团\n超级明星","ghostType_03","普通亡灵","ghostWeek_03","惧怕法阵","ghostBack_03","背景: 从数字马戏团穿越而来的帕姆尼，被学校怨灵所控制，怨灵复制了帕姆尼的外形，继续在学校中游荡……",[200,3],[1000,4],null,null],[2,"阴暗爬行帕姆尼","walkpamuni",0,"296996","338333","ghostName_04","阴暗爬行帕姆尼","ghostUnlock_04","恐怖鬼校\n无法站立行走\n阴暗潮湿的地方","ghostType_04","动物亡灵","ghostWeek_04","十分饥饿，渴望食物","ghostBack_04","背景: 地下道中本是校长养着的爱犬——杰克，血月的出现迫使校长对它下了狠手，杰克也没能幸免，继续使用帕姆尼的身躯，在下水道寻找食物……",[200,3],[1000,4],null,null],[3,"羞羞帕姆尼","starepamuni",0,"296983","338271","ghostName_05","羞羞帕姆尼","ghostUnlock_05","恐怖鬼校\n害羞扭曲的性格\n和假人躲在一起","ghostType_05","羞羞亡灵","ghostWeek_05","对于他注视就像魔法，盯住就被麻痹了似的","ghostBack_05","背景: 以前，学校的化学教室中总有一个小女孩做实验到放学，她生性胆小害羞，最后却在这里被坏学生用化学药品伤害而亡，她的亡灵就被封印在了这间教室里……",[200,3],[1000,4],null,null],[4,"闪灵帕姆尼","sparkpamuni",0,"297005","338315","ghostName_06","闪灵帕姆尼","ghostUnlock_06","恐怖鬼校\n一闪一闪\n只会在二楼出现","ghostType_06","闪烁亡灵","ghostWeek_06","被禁锢在固定区域","ghostBack_06","背景: 校长办公室是学校的禁地，学生从来没见过校长直接进入到办公室里。有一天，一个好奇的学生跟着校长的路线进入了办公室，他却再也没有出来过……",[200,3],[1000,4],null,null],[5,"护士帕姆尼","nursepamuni",0,"296998","340117","ghostName_02","护士帕姆尼","ghostUnlock_02","疯人院\n四处游荡\n随处可见","ghostType_02","红月生物","ghostWeek_02","似乎进不去一些门","ghostBack_02","背景: 原本是纯洁善良的生物\n在红月的长时间浸染下，逐渐失去了自我\n即便如此，也仍有被拯救的可能",[200,3],[1000,4],null,null],[6,"影人","shadow",0,"296986","338261","ghostName_01","影人","ghostUnlock_01","惊魂岛\n血月爪牙\n另一个\"我\"","ghostType_01","黑暗的牲灵","ghostWeek_01","极度讨厌碍事的建筑","ghostBack_01","背景: 我了解你的一切...\n你的存在、你的恐惧...\n凭什么我只能成为你的影子？\n取代我，或者消灭你！",[200,3],[1000,4],null,null],[7,"安娜","anna",0,"296980","338297","ghostName_07","安娜","ghostUnlock_07","丧尸小镇\n商店\n河边","ghostType_07","普通丧尸","ghostWeek_07","十分容易被击晕","ghostBack_07","背景: 小镇的生活是重复的，毫无乐趣的，安娜一直为这无聊的生活而烦恼，她想改变。直到红月的出现，她成为了第一个被影响的人",[200,3],[1000,4],null,null],[8,"弗兰克","franck",0,"297002","338223","ghostName_08","弗兰克","ghostUnlock_08","丧尸小镇\n四处游荡\n必经之路","ghostType_08","普通丧尸","ghostWeek_08","十分容易被击晕","ghostBack_08","背景: 弗兰克是个不苟言笑的人，在别人看来完全不像个年轻人，显得十分古板，但只有他自己知道，他有着自己的世界",[200,3],[1000,4],null,null],[9,"蒂奇","teach",0,"297081","338224","ghostName_09","蒂奇","ghostUnlock_09","丧尸小镇\n镰刀\n总在屋子里","ghostType_09","特殊丧尸","ghostWeek_09","击晕后晕倒时间长","ghostBack_09","背景: 曾经想当海盗，于是给左手装上镰刀，但受到母亲的反对，被母亲狠狠教育后，只能选择选择留在了小镇里，利用镰刀左手成为了小镇里有名的割麦子高手",[200,3],[1000,4],null,null],[10,"爱丽丝","alice",0,"296975","338309","ghostName_10","爱丽丝","ghostUnlock_10","丧尸小镇\n岔路口发呆\n红发双马尾","ghostType_10","小孩丧尸","ghostWeek_10","行动区域小","ghostBack_10","背景: 爱丽丝是小镇里最顽皮的小孩，每天在小镇里上窜下跳，但红月影响后，她变得沉默，整天呆在路口发呆，但脾气变得暴躁，攻击性极强",[200,3],[1000,4],null,null],[11,"杰克","jack",0,"297078","338325","ghostName_11","杰克","ghostUnlock_11","丧尸小镇\n胖胖的\n巨大的刀","ghostType_11","特殊丧尸","ghostWeek_11","行动缓慢","ghostBack_11","背景: 小镇里唯一的屠夫，虽然长得很吓人但实际上是个热心肠。红月之后，他第一个站出来，用他巨大的刀守护还未受红月光芒影响的人",[200,3],[1000,4],null,null],[12,"凯莉","kelly",0,"296981","338341","ghostName_12","凯莉","ghostUnlock_12","丧尸小镇\n家附近闲逛\n白发双马尾","ghostType_12","小孩丧尸","ghostWeek_12","不会攻击","ghostBack_12","背景: 凯莉是小镇里最后一个被红月影响的人。杰克被影响前，用最后的理智将她锁在了见不到光的房间，终究无济于事，但她成为了小镇里唯一不会攻击的人",[200,3],[1000,4],null,null],[13,"杜姆","doom",0,"317610","338349","ghostName_13","杜姆","ghostUnlock_13","丧尸小镇的十字路口浑身通红","ghostType_13","特殊丧尸","ghostWeek_13","自爆期间无法移动","ghostBack_13","背景：没有人知道杜姆从何而来，他第一次出现在小镇上时，已经是一副危险的模样了，全身上下没有一处是未经改造的",[200,3],[1000,4],null,null],[14,"薇薇安","vivian",0,"317611","338217","ghostName_14","薇薇安","ghostUnlock_14","丧尸小镇别墅附近身着紫色长袍","ghostType_14","特殊丧尸","ghostWeek_14","解毒药可以防止中毒","ghostBack_14","背景：小镇里有一位神秘的女巫，传言里她总是会突然出现，操纵巫术为小镇居民占卜与治疗，但同时她也可以随心所欲地施加伤害",[200,3],[1000,4],null,null],[15,"大嘴伪人","Faker1",0,"326892","338377","GhostName_15","大嘴形态伪人","ghostUnlock_15","伪装成人类潜伏在恐怖乐园各处","ghostType_15","伪人","ghostWeek_15","异常害怕尖叫鸡","ghostBack_15","背景：它们极度危险，通过模拟人的五官表情和行为，干掉一个人类，并伪装成此人的样子继续寻找下一个目标…",[200,3],[1000,4],null,null],[16,"电视伪人","Faker2",0,"326897","338312","ghostName_15","电视形态伪人","ghostUnlock_16","伪装成人类潜伏在恐怖乐园各处","ghostType_16","伪人","ghostWeek_16","异常害怕尖叫鸡","ghostBack_16","背景：它们极度危险，通过模拟人的五官表情和行为，干掉一个人类，并伪装成此人的样子继续寻找下一个目标…",[200,3],[1000,4],null,null],[17,"捧花伪人","Faker3",0,"326899","338368","GhostName_16","捧花形态伪人","ghostUnlock_17","伪装成人类潜伏在恐怖乐园各处","ghostType_17","伪人","ghostWeek_17","异常害怕尖叫鸡","ghostBack_17","背景：它们极度危险，通过模拟人的五官表情和行为，干掉一个人类，并伪装成此人的样子继续寻找下一个目标…",[200,3],[1000,4],null,null],[18,"大眼伪人","Faker4",0,"326893","338302","ghostName_16","大眼形态伪人","ghostUnlock_18","伪装成人类潜伏在恐怖乐园各处","ghostType_18","伪人","ghostWeek_18","异常害怕尖叫鸡","ghostBack_18","背景：它们极度危险，通过模拟人的五官表情和行为，干掉一个人类，并伪装成此人的样子继续寻找下一个目标…",[200,3],[1000,4],null,null],[19,"长腿妈妈","MommyLongLegs",0,null,"338804","ghostName_19","长腿妈妈","ghostUnlock_19","只有特定时间能遇到的神秘生物","ghostType_19","异世生物","ghostWeek_19","十分惧怕灵异相机","ghostBack_19","背景：异世而来的生物，有着极端的自我意识，对1006这个数字异常恐惧，对逃生者充满敌意，但异世而来的她似乎无法真正伤害到逃生者。",[200,3],[1000,4],null,[[0,16,0,17],[0,18,0,19],[0,20,0,21],[1,17,1,18],[1,19,1,20],[2,16,2,17],[2,18,2,19],[2,20,2,21],[3,17,3,18],[3,19,3,20],[4,16,4,18],[5,17],[5,19],[6,18,6,20]]],[20,"亲吻米西","KissyMissy",0,null,"338824","ghostName_20","亲吻米西","ghostUnlock_20","只有特定时间能遇到的神秘生物","ghostType_20","异世生物","ghostWeek_20","惧怕长腿妈妈","ghostBack_20","背景：异世而来的生物，对人十分友善，但见到长腿妈妈时就会惧怕起一切。",[200,3],[1000,4],null,[[0,0,0,1],[0,7,0,8],[0,14,0,15],[0,20,0,21],[1,1,1,2],[1,8,1,9],[1,15,1,16],[1,21,1,22],[2,2,2,3],[2,9,2,10],[2,16,2,17],[2,22,2,23],[3,3,3,4],[3,10,3,11],[3,17,3,18],[3,23,3,24],[4,4,4,5],[4,11,4,12],[4,16,4,17],[4,23,4,24],[5,5,5,6],[5,12,5,13],[5,17,5,18],[5,23,5,24],[6,6,6,7],[6,13,6,14],[6,18,6,19],[6,23,6,24]]],[21,"迷你好奇","MiniHuggies",0,null,"338811","ghostName_21","迷你好奇","ghostUnlock_21","只有特定时间能遇到的神秘生物","ghostType_21","异世生物","ghostWeek_21","会受到长腿妈妈的控制","ghostBack_21","背景：异世而来的生物，受到长腿妈妈的控制，平时不会主动攻击，一旦长腿妈妈出现在附近就会变得异常有进攻，但异世而来的她似乎无法真正伤害到逃生者。",[200,3],[1000,4],null,[[0,0,0,2],[0,14,0,16],[1,2,1,4],[1,16,1,18],[2,4,2,6],[2,18,2,20],[3,6,3,8],[3,20,3,22],[4,8,4,10],[4,18,4,20],[4,23,4,24],[5,10,5,12],[5,16,5,17],[5,19,5,20],[5,23,5,24],[6,12,6,14],[6,16,6,18],[6,23,6,24]]],[22,"胆小鸡","kickinChicken",0,null,"338819","ghostName_22","胆小鸡","ghostUnlock_22","只有特定时间能遇到的神秘生物","ghostType_22","异世生物","ghostWeek_22","会受到长腿妈妈的控制","ghostBack_22","背景：异世而来的生物，惧怕这一切，但长腿妈妈出现在在附近时会变得不再恐惧，甚至有些狂躁，但异世而来的她似乎无法真正伤害到逃生者。",[200,3],[1000,4],null,[[0,1,0,2],[0,8,0,9],[0,15,0,16],[0,22,0,23],[1,0,1,1],[1,2,1,3],[1,9,1,10],[1,16,1,17],[1,23,1,22],[2,3,2,4],[2,10,2,11],[2,17,2,18],[2,23,2,24],[3,4,3,5],[3,11,3,12],[3,18,3,19],[3,23,3,24],[4,5,4,6],[4,12,4,13],[4,17,4,19],[4,23,4,24],[5,6,5,7],[5,13,5,14],[5,16,5,18],[5,20,5,21],[5,23,5,24],[6,7,6,8],[6,14,6,15],[6,18,6,20],[6,21,6,22],[6,23,6,24]]],[23,"PJ","PJ",0,null,"338790","ghostName_23","PJ","ghostUnlock_23","只有特定时间能遇到的神秘生物","ghostType_23","异世生物","ghostWeek_23","惧怕长腿妈妈","ghostBack_23","背景：异世而来的生物，对玩家十分好奇，受到刺激就会发起攻击，长腿妈妈出现在附近时会惧怕一切。",[200,3],[1000,4],null,[[0,4,0,6],[0,18,0,20],[1,2,1,4],[1,6,1,8],[1,20,1,22],[2,0,2,2],[2,8,2,10],[2,22,2,24],[3,10,3,12],[3,23,3,24],[4,12,4,14],[4,19,4,20],[4,23,4,24],[5,14,5,16],[5,17,5,18],[5,23,5,24],[6,19,6,20],[6,23,6,24]]],[24,"跳跳兔","HppyHopcotch",0,null,"338822","ghostName_24","跳跳兔","ghostUnlock_24","只有特定时间能遇到的神秘生物","ghostType_24","异世生物","ghostWeek_24","长腿妈妈的助力","ghostBack_24","背景：异世而来的生物，存在性格缺陷，会攻击看到的人，长腿妈妈出现在附近时会变得疯狂，但异世而来的她似乎无法真正伤害到逃生者。",[200,3],[1000,4],null,[[0,3,0,4],[0,10,0,11],[0,17,0,18],[1,2,1,3],[1,4,1,5],[1,11,1,12],[1,18,1,19],[2,1,2,2],[2,5,2,6],[2,12,2,13],[2,19,2,20],[3,0,3,1],[3,6,3,7],[3,13,3,14],[3,20,3,21],[4,7,4,8],[4,14,4,15],[4,16,4,18],[4,21,4,22],[5,8,5,9],[5,15,5,17],[5,22,5,23],[6,9,6,10],[6,17,6,19],[6,23,6,24]]],[25,"邦佐兔","BunzoBunny",0,null,"338799","ghostName_25","邦佐兔","ghostUnlock_25","只有特定时间能遇到的神秘生物","ghostType_25","异世生物","ghostWeek_25","及其惧怕长腿妈妈","ghostBack_25","背景：异世而来的生物，害怕很多事物，在长腿妈妈出现时甚至会害怕到走不动道。",[200,3],[1000,4],null,[[0,8,0,11],[0,23,0,24],[1,6,1,9],[1,11,1,14],[1,23,1,24],[2,4,2,7],[2,13,2,16],[2,23,2,24],[3,2,3,5],[3,15,3,18],[3,23,3,24],[4,0,4,3],[4,19,4,20],[4,23,4,24],[5,18,5,19],[5,23,5,24],[6,17,6,18],[6,20,6,24]]]];
export interface IGhostGraphElement extends IElementBase{
 	/**id*/
	id:number
	/**备注*/
	back:string
	/**鬼怪的标志（鬼的程序名）*/
	tag:string
	/**显示权重（现根据id排序，再把权重大的放在前面）*/
	viewWeight:number
	/**鬼怪的图资源id（未解锁）*/
	imgGuid:string
	/**鬼怪的图资源id（已解锁）*/
	unlockedImgGuid:string
	/**名字*/
	name:string
	/**名字*/
	name_Desc:string
	/**解锁的提示*/
	unlockTips:string
	/**解锁的提示*/
	unlockTips_Desc:string
	/**类别*/
	typeDesc:string
	/**类别*/
	typeDesc_Desc:string
	/**弱点*/
	weekDesc:string
	/**弱点*/
	weekDesc_Desc:string
	/**背景*/
	backDesc:string
	/**背景*/
	backDesc_Desc:string
	/**恐惧币奖励|奖励品质*/
	gfearcoin:Array<number>
	/**魅力值奖励|奖励品质*/
	gpopular:Array<number>
	/**道具奖励|奖励数量（暂时没有，挖个坑）*/
	gprice:Array<number>
	/**怪物出没时间（常驻填-1）*/
	activeTime:Array<Array<number>>
 } 
export class GhostGraphConfig extends ConfigBase<IGhostGraphElement>{
	constructor(){
		super(EXCELDATA);
	}

}