import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","desc","desc_desc","tab"],["","Language","",""],[3001,"Notebook1_1","血月降临了，得想办法逃出去！一楼大厅的学校大门，或者地下…我，快不行了",1],[3002,"Notebook1_2","我能感受到驱魔人留下的蜡烛中蕴藏着巨大能量，或许可以用它点燃其它蜡烛",1],[3003,"Notebook1_3","学校被人为设置了各种机关，似乎在隐藏什么秘密",1],[3004,"Notebook1_4","被抓到会被打晕昏睡1天，我们每个人都只有 5 天的时间逃出去，否则会被吃掉…",1],[3005,"Notebook1_5","只有个别房间和柜子里是安全的，其它地方…我不确定",1],[3006,"Notebook1_6","背包的容量是有限的，暂时不用的东西可以丢在原地",1],[3007,"Notebook2_1","伙伴说：生物教室被看管着，别怕，它只敢在背后偷偷靠近",2],[3008,"Notebook2_2","帕姆尼，你怎么了？！你不认识我了吗",2],[3009,"Notebook2_3","二楼的走廊尽头，常常传来学生的惨叫…它，它在背后！",2],[3010,"Notebook2_4","每当血月降临，世间将诞生无数痛苦与恶念……",2],[3011,"Notebook2_5","班上的“同学”为什么一直盯着我？！",2],[3012,"Notebook2_6","我不相信……帕姆尼是不会伤害我的！她一定是被恶灵控制了才会变成这样！",2],[3013,"Notebook3_1","校长办公室的门一直锁着，难道藏了什么不为人知的秘密？",3],[3014,"Notebook3_2","那是…一个暗门？有谁在求救吗？太远了，我听不清",3],[3015,"Notebook3_3","我的同伴们…都去哪了？我快撑不下去了…",3],[3016,"Notebook3_4","只能从一侧打开的门，我得从其它的地方过去",3],[3017,"Notebook3_5","校长在一楼的某个教室角落里改造了一部电梯，不知道通向哪里…",3],[3018,"Notebook3_6","我能感受到驱魔人的意志在冥冥之中保护着我们",3],[3019,"Notebook4_1","我经常看到校长刷卡进入一个暗门……",4],[3020,"Notebook4_2","我要逃离这里…不，我想带大家一起逃出去！",4],[3021,"Notebook4_3","地下室连接某处的通路被挡住了？还是先把地上的球整理一下吧",4],[3022,"Notebook4_4","我受够了……躲来躲去的日子，好害怕",4],[3023,"Notebook4_5","我要振作起来，伙伴们都在保护我！",4],[3024,"Notebook4_6","三角、圆圈、方块，貌似需要三把钥匙才能离开这里",4],[3025,"Notebook5_1","监控室……难道我们一直在校长被监视着？",5],[3026,"Notebook5_2","校长室里竟然设了一个祭坛？！或许有什么不想被我们发现的东西藏在里面…",5],[3027,"Notebook5_3","我受伤了……二楼的医务室里应该有绷带",5],[3028,"Notebook5_4","她怎么在哭……是想到了悲伤的事情吗",5],[3029,"Notebook5_5","学校到处悬挂着令人感到不安的油画",5],[3030,"Notebook5_6","前面是校长的休息室，我看到校长有好几次进入密室前都来这里取东西",5],[3031,"Notebook6_1","保洁室，看样子经常有同伴被关在这里",6],[3032,"Notebook6_2","画室似乎很安全…咦？这里怎么有一个奇怪的颜料箱",6],[3033,"Notebook6_3","伴随着发动机的轰鸣声，连音乐都变得绝望而悲伤",6],[3034,"Notebook6_4","听说不小心闯入地下室的学生会被吃掉，除非…你能给她美味的肉饼",6],[3035,"Notebook6_5","我不相信……帕姆尼是不会伤害我的！她一定是被恶灵控制了才会变成这样！",6],[3036,"Notebook6_6","地下暗河…似乎是一个绝佳的逃跑路径！",6]];
export interface INotebookElement extends IElementBase{
 	/**ID*/
	id:number
	/**描述的多语言key*/
	desc:string
	/**多语言备注*/
	desc_desc:string
	/**页签*/
	tab:number
 } 
export class NotebookConfig extends ConfigBase<INotebookElement>{
	constructor(){
		super(EXCELDATA);
	}

}