import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Faction","AssetID"],["","",""],[1,"白天BGM","131499"],[2,"夜晚BGM","126339"],[3,"按钮点击","205305"],[4,"按钮松开","205427"],[5,"攻击音效","136201"],[6,"怪物受击音效","210005"],[7,"钟声","271263"],[8,"走路音效","204080"],[9,"喘息音效","210100"],[10,"怪物喘息音效","200952"],[11,"消耗San值音效","207130"],[12,"恢复San值音效","169179"],[13,"心跳声","204578"],[14,"精神陷入癫狂的音效","199982"],[15,"高跟鞋走路","120836"],[16,"玩偶走路","203939"],[17,"大胖子走路","204056"],[18,"怪物叫声","210053"],[19,"追击音效","201126"],[20,"追击音效","162709"],[21,"追击音效","121749"],[22,"追击音效","205392"],[23,"追击音效","205392"],[24,"追击音效","234450"],[25,"追击音效","130808"],[26,"追击音效","245369"],[27,"玩家求救音效","287160"],[28,"开柜子","124985"],[29,"关柜子","124963"],[30,"被怪物发现","124976"],[31,"被小眼怪发现音效","298420"],[32,"大眼怪出现音效","298421"],[33,"玩家在大眼怪附近紧张的环境音乐","298424"],[34,"大眼怪技能音效","298425"],[35,"小眼怪飞行音效","298426"],[36,"被大眼怪发现音效","298427"],[37,"玩家在大眼怪附近的心跳声","298428"],[38,"玩家在大眼怪附近的白噪音（背景音）","298430"],[39,"大眼怪消失音效","298429"]];
export interface IAudioElement extends IElementBase{
 	/**id*/
	id:number
	/**功能*/
	Faction:string
	/**音效ID*/
	AssetID:string
 } 
export class AudioConfig extends ConfigBase<IAudioElement>{
	constructor(){
		super(EXCELDATA);
	}

}