import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Name","Guid","Icon","Time","Repeat","slot"],["","","","","","",""],[1,"双手持镰跑","115465",null,0.67,true,0],[2,"丧尸待机","122509",null,2,true,0],[3,"正面倒地死亡","52996",null,1.7,true,0],[4,"禁锢、眩晕","53005",null,1.53,true,0],[5,"南瓜头攻击","117378",null,2,false,0],[6,"南瓜头\\小男孩巡逻","97857",null,1.87,true,0],[7,"小男孩攻击","97856",null,2.17,false,0],[8,"小男孩追击","97860",null,0.6,true,0],[9,"小丑攻击","96578",null,1.07,false,0],[10,"小丑追击","14659",null,0.47,true,0],[11,"小丑巡逻","146744",null,1.07,true,0],[12,"瘟疫医生攻击","162183",null,2.13,false,0],[13,"瘟疫医生追击","121567",null,0.6,true,0],[14,"瘟疫医生巡逻","121568",null,1.03,true,0],[15,"死亡特效","20262",null,4,false,0],[16,"小丑追击2","14580",null,0.57,true,0],[17,"小丑追击3","14698",null,0.53,true,0],[18,"小丑追击4","14511",null,0.4,true,0],[19,"小丑白天动作1 小熊跳舞","200201",null,11.87,false,0],[20,"小丑白天动作2 老虎爱跳舞","129503",null,6.47,false,0],[21,"小丑白天动作3 螃蟹舞","29748",null,19.17,false,0],[22,"小丑白天动作4 歌舞伎甩头","14554",null,3.33,false,0],[23,"小丑白天动作5 美少女出场","47766",null,4.83,false,0],[24,"女小丑巡逻","164987",null,1.07,true,0],[25,"机械启动","123407",null,2,false,0],[26,"NPC白天姿势1","97864",null,2,false,0],[27,"NPC白天姿态2","99144",null,2,false,0],[28,"NPC白天姿势2","91954",null,2,false,0],[29,"NPC白天姿态3","144302",null,2,false,0],[30,"NPC白天姿势3","14023",null,2,false,0],[31,"宜家跑步姿态1","146121",null,0.53,false,0],[32,"宜家跑步姿态1","14643",null,0.8,false,0],[33,"宜家员工普通攻击02","224942",null,1.67,false,0],[34,"宜家员工普通攻击03","223234",null,1.67,false,0],[35,"机械启动","123407",null,0.5,false,0],[36,"跑步3","29738",null,0.2,false,0],[37,"跑步4","230708",null,0.1,false,0],[38,"僵尸攻击3","122558",null,2,false,0],[39,"僵尸攻击5","122560",null,2,false,0],[40,"巡视","14623",null,3.7,false,0],[41,"丧尸女追击","97860",null,1.33,true,0],[42,"玩具熊追击","146121",null,0.53,true,0],[43,"小萝莉追击","220255",null,0.73,true,0],[44,"兔子追击","156818",null,0.67,true,0],[45,"屠夫追击","122489",null,1.6,true,0],[46,"无头骑士追击","121911",null,1.07,true,0],[47,"面具男追击","122531",null,0.6,true,0],[48,"裂口女追击","121911",null,1.07,true,0],[49,"丧尸女追击","97857",null,1.87,true,0],[50,"玩具熊追击","146774",null,0.8,true,0],[51,"小萝莉追击","162005",null,1.07,true,0],[52,"兔子追击","14561",null,1.07,true,0],[53,"屠夫追击","122489",null,1.6,true,0],[54,"无头骑士追击","52985",null,1.07,true,0],[55,"面具男追击","122508",null,1.07,true,0],[56,"裂口女追击","52985",null,1.07,true,0],[57,"攻击","121643",null,1,false,0],[58,"发现玩家","217872",null,1.5,false,0],[59,"大眼怪出现","121568",null,2.6,false,0],[60,"举起玩家","14525",null,1.33,true,1],[61,"花缠寻路","122514",null,1.07,true,0],[62,"花缠追击","156788",null,1,true,0],[63,"科目三","269164","317062",43,false,0],[64,"霹雳舞","303272",null,29,false,0],[65,"青海摇","303239","317084",23,false,0],[66,"骑马舞","285742","317074",5,false,0],[67,"恐龙抗狼","279619","317087",12,false,0],[68,"铁山靠","269037","317059",5,false,0]];
export interface INPCAnimationElement extends IElementBase{
 	/**唯一ID*/
	id:number
	/**动画、姿态*/
	Name:string
	/**姿态、动画GUID*/
	Guid:string
	/**动画icon*/
	Icon:string
	/**播放时间*/
	Time:number
	/**是否重复播放*/
	Repeat:boolean
	/**播放插槽*/
	slot:number
 } 
export class NPCAnimationConfig extends ConfigBase<INPCAnimationElement>{
	constructor(){
		super(EXCELDATA);
	}

}