import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","des","Guid","singleType","SlotType","circulate","sound","StrikeZone"],["","","","","","","",""],[1,"推车上半身","144189",1,1,0,0,null],[2,"单手看书上半身","144199",1,1,0,0,null],[3,"举起上半身","122440",1,1,0,0,null],[4,"翻书动画","98755",0,1,0,0,null],[5,"持枪跑动画","101342",0,1,0,0,null],[6,"举牌子动画","98742",0,1,0,0,null],[7,"坐下全身动画","170905",0,3,0,0,null],[8,"给上半身动画","35385",0,1,0,0,null],[9,"拿上半身动画","120392",0,1,0,0,null],[10,"敲键盘动画","98740",0,1,0,0,null],[11,"躺下动画","35427",0,3,0,0,null],[12,"手抓吃东西","14780",0,1,0,0,null],[13,"双手拿东西","35384",0,1,0,0,null],[14,"接电话","35387",0,1,0,0,null],[15,"拿书讲课","84518",0,1,0,0,null],[16,"送花","98754",0,1,0,0,null],[17,"坐下看书","29734",0,3,0,0,null],[18,"投篮","35436",0,1,0,0,null],[19,"单手投掷","146188",0,1,0,0,null],[20,"投降","135139",0,1,0,0,null],[21,"单手打蝶","123712",0,1,0,0,null],[22,"单手提物动画姿态","144198",0,1,0,0,null],[23,"持枪瞄准","4167",0,1,0,0,null],[24,"持枪双手","98607",0,1,0,0,null],[25,"狙击瞄准","99961",0,1,0,169140,null],[26,"单手持枪","98611",0,1,0,0,null],[27,"托拿","99143",0,1,0,0,null],[28,"打针","157329",0,1,0,0,null],[29,"胸前拿","35432",0,1,0,0,null],[30,"双手递","124527",0,1,1,0,null],[31,"喝水动画","8356",0,1,0,0,null],[32,"双手托举","20257",0,1,0,0,null],[33,"投篮姿态","145932",1,1,0,0,null],[34,"斜拿动画","35386",0,1,0,0,null],[35,"递给动画","35410",0,1,0,0,null],[36,"浇水向下动画","35406",0,1,0,0,null],[37,"手枪射击","80589",0,1,0,0,null],[38,"手枪换弹","14018",0,1,0,0,null],[39,"挥舞棋子","98610",0,1,0,0,null],[40,"打扫","86092",0,1,0,0,null],[41,"梳头","29746",0,1,0,0,null],[42,"帮别人梳头","35391",0,1,0,0,null],[43,"胜利举杯","123713",0,1,0,0,null],[44,"吃汉堡","8357",0,1,0,0,null],[45,"劈柴","20270",0,1,0,0,null],[46,"斜劈","20243",0,1,0,0,null],[47,"背手","14583",0,1,0,0,null],[48,"吉他待机","35415",0,1,0,0,null],[49,"吉他1‘’","35412",0,1,0,169121,null],[50,"举哑铃","145172",0,1,0,0,null],[51,"魔杖施法","85024",0,3,0,0,null],[52,"魔杖跳舞","122809",0,3,0,0,null],[53,"魔杖芭蕾","29733",0,3,0,0,null],[54,"举着火把","98606",0,1,0,0,null],[55,"右横劈","20243",0,3,0,0,null],[56,"左横劈","20249",0,3,0,0,null],[57,"战斗精灵","29718",0,3,0,0,null],[58,"荡秋千","122449",0,1,0,0,null],[59,"拖行李箱姿态","144191",1,1,0,0,null],[60,"双手托拿","35434",0,1,0,0,null],[61,"扫把","98741",0,1,0,0,null],[62,"待机","33579",0,1,0,0,null],[63,"抱小孩","35442",0,1,0,0,null],[64,"骑鲸鱼","169638",0,3,0,0,null],[65,"举牌子动画","174562",0,1,0,0,null],[66,"冲锋枪射击","99647",0,1,0,0,null],[67,"单手锤子挥砍","29747",0,3,0,0,[0.5,0.6]],[68,"持刀战斗","117403",0,1,0,0,null],[69,"吃东西","14762",0,1,0,0,null]];
export interface IPropActionElement extends IElementBase{
 	/**id*/
	id:number
	/**备注*/
	des:string
	/**动作guid*/
	Guid:string
	/**0.动画 1.姿态 单人动作是否为姿态*/
	singleType:number
	/**1.上半身2下半身3全身*/
	SlotType:number
	/**是否循环*/
	circulate:number
	/**音效*/
	sound:number
	/**动画攻击区间
开始攻击判定|结束攻击判定*/
	StrikeZone:Array<number>
 } 
export class PropActionConfig extends ConfigBase<IPropActionElement>{
	constructor(){
		super(EXCELDATA);
	}

}