import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","cloth","trailer","widget","enValue","chValue"],["","","","","",""],[1,1010,[40001],1,"英文称号1","中文称号1"],[2,1011,[40003],1,"英文称号2","中文称号2"],[3,1012,[40007],1,"英文称号3","中文称号3"],[4,1013,[40002],1,"英文称号4","中文称号4"],[5,1014,[40010],1,"英文称号5","中文称号5"],[6,1020,[40001],1,"英文称号6","中文称号6"],[7,1021,[40003],1,"英文称号7","中文称号7"],[8,1022,[40007],1,"英文称号8","中文称号8"],[9,1023,[40002],1,"英文称号9","中文称号9"],[10,1024,[40010],1,"英文称号10","中文称号10"],[11,1030,[40001],1,"英文称号11","中文称号11"],[12,1031,[40003],1,"英文称号12","中文称号12"],[13,1032,[40007],1,"英文称号13","中文称号13"],[14,1033,[40002],1,"英文称号14","中文称号14"],[15,1034,[40010],1,"英文称号15","中文称号15"],[16,1040,[40001],1,"英文称号16","中文称号16"],[17,1041,[40003],1,"英文称号17","中文称号17"],[18,1042,[40007],1,"英文称号18","中文称号18"],[19,1043,[40002],1,"英文称号19","中文称号19"],[20,1044,[40010],1,"英文称号20","中文称号20"],[21,1050,[40001],1,"英文称号21","中文称号21"],[22,1051,[40003],1,"英文称号22","中文称号22"],[23,1052,[40007],1,"英文称号23","中文称号23"],[24,1053,[40002],1,"英文称号24","中文称号24"],[25,1054,[40010],1,"英文称号25","中文称号25"]];
export interface IAvatarAIElement extends IElementBase{
 	/**id*/
	id:number
	/**AI皮肤*/
	cloth:number
	/**AI拖尾*/
	trailer:Array<number>
	/**权重*/
	widget:number
	/**英文称号*/
	enValue:string
	/**中文称号*/
	chValue:string
 } 
export class AvatarAIConfig extends ConfigBase<IAvatarAIElement>{
	constructor(){
		super(EXCELDATA);
	}

}