import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Des","grade_Value"],["","",""],[10001,"1级","0"],[10002,"2级","20"],[10003,"3级","50"],[10004,"4级","90"],[10005,"5级","140"],[10006,"6级","200"],[10007,"7级","270"],[10008,"8级","350"],[10009,"9级","440"],[10010,"10级","540"],[10011,"11级","650"],[10012,"12级","770"],[10013,"13级","900"],[10014,"14级","1040"],[10015,"15级","1190"],[10016,"16级","1350"],[10017,"17级","1520"],[10018,"18级","1700"],[10019,"19级","1890"],[10020,"20级","2090"],[10021,"21级","2300"],[10022,"22级","2520"],[10023,"23级","2750"],[10024,"24级","2990"],[10025,"25级","3240"],[10026,"26级","3500"],[10027,"27级","3770"],[10028,"28级","4050"],[10029,"29级","4340"],[10030,"30级","4640"]];
export interface IPlayerGradeElement extends IElementBase{
 	/**序号
10000：玩家等级相关*/
	ID:number
	/**描述*/
	Des:string
	/**晋升到该等级所需的经验值*/
	grade_Value:string
 } 
export class PlayerGradeConfig extends ConfigBase<IPlayerGradeElement>{
	constructor(){
		super(EXCELDATA);
	}

}